terjeio/grblHAL/drivers/LPC1769/src/driver.c
/*

  driver.c - driver code for NXP LPC176x ARM processors

  Part of Grbl

  Copyright (c) 2018-2019 Terje Io

  Grbl is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.

  Grbl is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with Grbl.  If not, see <http://www.gnu.org/licenses/>.

*/

#include <LPC17xx.h>
#include <stdint.h>

#include "GRBL\grbl.h"

#include "driver.h"
#include "flash.h"
#include "serial.h"
#include "grbl-lpc/pwm_driver.h"

#if SDCARD_ENABLE
#include "sdcard.h"
#endif

static bool pwmEnabled = false, IOInitDone = false;
// Inverts the probe pin state depending on user settings and probing cycle mode.
static uint8_t probe_invert_mask;
static axes_signals_t next_step_outbits;
static spindle_pwm_t spindle_pwm;
static delay_t delay = { .ms = 1, .callback = NULL }; // NOTE: initial ms set to 1 for "resetting" systick timer on startup

#if STEP_OUTMODE == GPIO_MAP

    static const uint32_t c_step_outmap[8] = {
        0,
        X_STEP_BIT,
        Y_STEP_BIT,
        X_STEP_BIT|Y_STEP_BIT,
        Z_STEP_BIT,
        X_STEP_BIT|Z_STEP_BIT,
        Y_STEP_BIT|Z_STEP_BIT,
        X_STEP_BIT|Y_STEP_BIT|Z_STEP_BIT
    };

    static uint32_t step_outmap[8];

#endif

#if DIRECTION_OUTMODE == GPIO_MAP

    static const uint32_t c_dir_outmap[8] = {
        0,
        X_DIRECTION_BIT,
        Y_DIRECTION_BIT,
        X_DIRECTION_BIT|Y_DIRECTION_BIT,
        Z_DIRECTION_BIT,
        X_DIRECTION_BIT|Z_DIRECTION_BIT,
        Y_DIRECTION_BIT|Z_DIRECTION_BIT,
        X_DIRECTION_BIT|Y_DIRECTION_BIT|Z_DIRECTION_BIT
    };

    static uint32_t dir_outmap[8];

#endif

static uint_fast16_t spindle_set_speed (uint_fast16_t pwm_value);

// Interrupt handler prototypes

uint32_t cpt;

static void driver_delay (uint32_t ms, void (*callback)(void))
{
    if((delay.ms = ms) > 0) {
        SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk;
        if(!(delay.callback = callback))
            while(delay.ms);
    } else if(callback)
        callback();
}

// Enable/disable stepper motors
static void stepperEnable (axes_signals_t enable)
{
    enable.mask ^= settings.steppers.enable_invert.mask;
    BITBAND_PERI(STEPPERS_DISABLE_PORT->FIOPIN, STEPPERS_DISABLE_PIN) = enable.x;
}

// Starts stepper driver ISR timer and forces a stepper driver interrupt callback
static void stepperWakeUp (void)
{
    stepperEnable((axes_signals_t){AXES_BITMASK});

    STEPPER_TIMER->TCR = 0b10;          // reset
    STEPPER_TIMER->MR0 = 0xFFFF;        // Set a long initial delay,
    STEPPER_TIMER->TCR = 0b01;          // start stepper ISR timer in up mode
    hal.stepper_interrupt_callback();   // and start the show
}

// Disables stepper driver interrupts
static void stepperGoIdle (bool clear_signals) {
    STEPPER_TIMER->TCR = 0;   // Stop stepper timer
}

// Sets up stepper driver interrupt timeout, both "Normal" and AMASS version
static void stepperCyclesPerTick (uint32_t cycles_per_tick)
{
    STEPPER_TIMER->MR0 = cycles_per_tick;
}

// Set stepper pulse output pins
// NOTE: step_outbits are: bit0 -> X, bit1 -> Y, bit2 -> Z...
// Mapping to registers can be done by
// 1. bitbanding. Pros: can assign pins to different ports, no RMW needed. Cons: overhead, pin changes not synchronous
// 2. bit shift. Pros: fast, Cons: bits must be consecutive
// 3. lookup table. Pros: signal inversions done at setup, Cons: slower than bit shift?
inline static void stepperSetStepOutputs (axes_signals_t step_outbits)
{
#if STEP_OUTMODE == GPIO_BITBAND
    step_outbits.value ^= settings.step_invert.value;
    BITBAND_PERI(STEP_PORT->FIOPIN, X_STEP_PIN) = step_outbits.x;
    BITBAND_PERI(STEP_PORT->FIOPIN, Y_STEP_PIN) = step_outbits.y;
    BITBAND_PERI(STEP_PORT->FIOPIN, Z_STEP_PIN) = step_outbits.z;
#elif STEP_OUTMODE == GPIO_MAP
    STEP_PORT->FIOPIN = (STEP_PORT->FIOPIN & ~STEP_MASK) | step_outmap[step_outbits.value];
#else
    STEP_PORT->FIOPIN = (STEP_PORT->FIOPIN & ~STEP_MASK) | ((step_outbits.value << STEP_OUTMODE) ^ settings.step_invert.value);
#endif
}

// Set stepper direction output pins
// NOTE: see note for stepperSetStepOutputs()
inline static void stepperSetDirOutputs (axes_signals_t dir_outbits)
{
#if DIRECTION_OUTMODE == GPIO_BITBAND
    dir_outbits.value ^= settings.steppers.dir_invert.value;
    BITBAND_PERI(DIRECTION_PORT->FIOPIN, X_DIRECTION_PIN) = dir_outbits.x;
    BITBAND_PERI(DIRECTION_PORT->FIOPIN, Y_DIRECTION_PIN) = dir_outbits.y;
    BITBAND_PERI(DIRECTION_PORT->FIOPIN, Z_DIRECTION_PIN) = dir_outbits.z;
#elif DIRECTION_OUTMODE == GPIO_MAP
    DIRECTION_PORT->FIOPIN = (DIRECTION_PORT->FIOPIN & ~DIRECTION_MASK) | dir_outmap[dir_outbits.value];
#else
    DIRECTION_PORT->FIOPIN = (DIRECTION_PORT->FIOPIN & ~DIRECTION_MASK) | ((dir_outbits.value << DIRECTION_OUTMODE) ^ settings.dir_invert.value);
#endif
}

// Sets stepper direction and pulse pins and starts a step pulse
// When delayed pulse the step register is written in the step delay interrupt handler
static void stepperPulseStart (stepper_t *stepper)
{
    if(stepper->new_block) {
        stepper->new_block = false;
        stepperSetDirOutputs(stepper->dir_outbits);
    }

    if(stepper->step_outbits.value) {
		stepperSetStepOutputs(stepper->step_outbits);
		PULSE_TIMER->TCR = 1;
    }
}

// Sets stepper direction and pulse pins and starts a step pulse with and initial delay
static void stepperPulseStartDelayed (stepper_t *stepper)
{
    if(stepper->new_block) {
        stepper->new_block = false;
        stepperSetDirOutputs(stepper->dir_outbits);
    }

    if(stepper->step_outbits.value) {
		next_step_outbits = stepper->step_outbits; // Store out_bits
		PULSE_TIMER->TCR = 1;
    }
}

// Enable/disable limit pins interrupt
static void limitsEnable (bool on, bool homing)
{
    on = on && settings.limits.flags.hard_enabled;
    BITBAND_PERI(LIMIT_INTCLR, X_LIMIT_PIN) = 0;
    BITBAND_PERI(LIMIT_INTCLR, Y_LIMIT_PIN) = 0;
    BITBAND_PERI(LIMIT_INTCLR, Z_LIMIT_PIN) = 0;
    BITBAND_PERI(LIMIT_INTENR, X_LIMIT_PIN) = on;
    BITBAND_PERI(LIMIT_INTENR, Y_LIMIT_PIN) = on;
    BITBAND_PERI(LIMIT_INTENR, Z_LIMIT_PIN) = on;
}

// Returns limit state as an axes_signals_t variable.
// Each bitfield bit indicates an axis limit, where triggered is 1 and not triggered is 0.
inline static axes_signals_t limitsGetState()
{
    axes_signals_t signals;

#if LIMIT_INMODE == LIMIT_SHIFT
    signals.value = (uint8_t)(LIMIT_PORT->FIOPIN & LIMIT_MASK) >> LIMIT_SHIFT;
#elif LIMIT_INMODE == GPIO_BITBAND
    signals.x = BITBAND_PERI(LIMIT_PORT->FIOPIN, X_LIMIT_PIN);
    signals.y = BITBAND_PERI(LIMIT_PORT->FIOPIN, Y_LIMIT_PIN);
    signals.z = BITBAND_PERI(LIMIT_PORT->FIOPIN, Z_LIMIT_PIN);
#else
    uint8_t bits = LIMIT_PORT->FIOPIN;
    signals.x = (bits & X_LIMIT_PIN) != 0;
    signals.y = (bits & Y_LIMIT_PIN) != 0;
    signals.z = (bits & Z_LIMIT_PIN) != 0;
#endif


    if (settings.limits.invert.mask)
        signals.value ^= settings.limits.invert.mask;

    return signals;
}

// Returns system state as a control_signals_t variable.
// Each bitfield bit indicates a control signal, where triggered is 1 and not triggered is 0.
static control_signals_t systemGetState (void)
{
    control_signals_t signals = {0};
#if LIMIT_INMODE == GPIO_BITBAND
    signals.reset = BITBAND_PERI(CONTROL_PORT->FIOPIN, RESET_PIN);
    signals.safety_door_ajar = BITBAND_PERI(CONTROL_PORT->FIOPIN, SAFETY_DOOR_PIN);
    signals.feed_hold = BITBAND_PERI(CONTROL_PORT->FIOPIN, FEED_HOLD_PIN);
    signals.cycle_start = BITBAND_PERI(CONTROL_PORT->FIOPIN, CYCLE_START_PIN);
#else
    uint8_t bits = CONTROL_PORT->FIOPIN;
    signals.reset = bits & RESET_BIT != 0;
    signals.safety_door_ajar = bits & SAFETY_DOOR_BIT != 0;
    signals.feed_hold = bits & FEED_HOLD_BIT != 0;
    signals.cycle_start = bits & CYCLE_START_BIT != 0;
#endif
    if(settings.control_invert.mask)
        signals.value ^= settings.control_invert.mask;

    return signals;
}

// Sets up the probe pin invert mask to
// appropriately set the pin logic according to setting for normal-high/normal-low operation
// and the probing cycle modes for toward-workpiece/away-from-workpiece.
static void probeConfigureInvertMask(bool is_probe_away)
{
  probe_invert_mask = settings.flags.invert_probe_pin ? 0 : PROBE_BIT;

  if (is_probe_away)
      probe_invert_mask ^= PROBE_BIT;
}

// Returns the probe pin state. Triggered = true.
bool probeGetState (void)
{
    return ((PROBE_PORT->FIOPIN & PROBE_BIT) ^ probe_invert_mask) != 0;
}

// Static spindle (off, on cw & on ccw)

inline static void spindle_off (void)
{
    BITBAND_PERI(SPINDLE_ENABLE_PORT->FIOPIN, SPINDLE_ENABLE_PIN) = settings.spindle.invert.on;
}

