terjeio/grblHAL/drivers/LPC1769/src/driver.c
inline static void spindle_on (void)
{
    BITBAND_PERI(SPINDLE_ENABLE_PORT->FIOPIN, SPINDLE_ENABLE_PIN) = !settings.spindle.invert.on;
}

inline static void spindle_dir (bool ccw)
{
    if(hal.driver_cap.spindle_dir)
    	BITBAND_PERI(SPINDLE_DIRECTION_PORT->FIOPIN, SPINDLE_DIRECTION_PIN) = ccw ^ settings.spindle.invert.ccw;
}

// Start or stop spindle
static void spindleSetState (spindle_state_t state, float rpm)
{
    if (!state.on)
        spindle_off();
    else {
        spindle_dir(state.ccw);
        spindle_on();
    }
}

// Variable spindle control functions

// Sets spindle speed
static uint_fast16_t spindle_set_speed (uint_fast16_t pwm_value)
{
    if (pwm_value == spindle_pwm.off_value) {
        pwmEnabled = false;
        if(settings.spindle.disable_with_zero_speed)
            spindle_off();
        pwm_disable(&SPINDLE_PWM_CHANNEL); // Set PWM output low
    } else {
        if(!pwmEnabled)
            spindle_on();
        pwmEnabled = true;
        pwm_set_period(pwm_value);
        pwm_enable(&SPINDLE_PWM_CHANNEL);
    }

    return pwm_value;
}

static void spindleUpdateRPM (float rpm)
{
    spindle_set_speed(spindle_compute_pwm_value(&spindle_pwm, rpm, false));
}

// Start or stop spindle
static void spindleSetStateVariable (spindle_state_t state, float rpm)
{
    if (!state.on || rpm == 0.0f) {
        spindle_set_speed(spindle_pwm.off_value);
        spindle_off();
    } else {
        if(!hal.driver_cap.spindle_dir)
            spindle_dir(state.ccw);

        spindle_set_speed(spindle_compute_pwm_value(&spindle_pwm, rpm, false));
    }
}

// Returns spindle state in a spindle_state_t variable
static spindle_state_t spindleGetState (void)
{
    spindle_state_t state = {0};

    state.on = (SPINDLE_ENABLE_PORT->FIOPIN & SPINDLE_ENABLE_BIT) != 0;
    state.ccw = hal.driver_cap.spindle_dir && (SPINDLE_DIRECTION_PORT->FIOPIN & SPINDLE_DIRECTION_BIT) != 0;
    state.value ^= settings.spindle.invert.mask;
    if(pwmEnabled)
    	state.value = On;

    return state;
}

// end spindle code

// Start/stop coolant (and mist if enabled)
static void coolantSetState (coolant_state_t mode)
{
    mode.value ^= settings.coolant_invert.mask;
    BITBAND_PERI(COOLANT_FLOOD_PORT->FIOPIN, COOLANT_FLOOD_PIN) = mode.flood;
    BITBAND_PERI(COOLANT_MIST_PORT->FIOPIN, COOLANT_MIST_PIN) = mode.mist;
}

// Returns coolant state in a coolant_state_t variable
static coolant_state_t coolantGetState (void)
{
    coolant_state_t state = {0};

    state.flood = (COOLANT_FLOOD_PORT->FIOPIN & COOLANT_FLOOD_BIT) != 0;
    state.mist  = (COOLANT_MIST_PORT->FIOPIN & COOLANT_MIST_BIT) != 0;
    state.value ^= settings.coolant_invert.mask;

    return state;
}

// Helper functions for setting/clearing/inverting individual bits atomically (uninterruptable)
static void bitsSetAtomic (volatile uint_fast16_t *ptr, uint_fast16_t bits)
{
	__disable_irq();
    *ptr |= bits;
    __enable_irq();
}

static uint_fast16_t bitsClearAtomic (volatile uint_fast16_t *ptr, uint_fast16_t bits)
{
	__disable_irq();
	uint_fast16_t prev = *ptr;
    *ptr &= ~bits;
    __enable_irq();
    return prev;
}

static uint_fast16_t valueSetAtomic (volatile uint_fast16_t *ptr, uint_fast16_t value)
{
	__disable_irq();
	uint_fast16_t prev = *ptr;
    *ptr = value;
    __enable_irq();
    return prev;
}

void gpio_pinmode (LPC_GPIO_TypeDef *port, uint8_t pin, uint8_t pinmode)
{
	port += LPC_PINCON_BASE - LPC_GPIO_BASE + 0x40;
	if(pin & 0x8) {
		port++;
		pin &= 0x7;
	}
	BITBAND_PERI(port, pin++) = pinmode & 0x1;
    BITBAND_PERI(port, pin)   = (pinmode >> 1) & 0x1;
}

// Configures peripherals when settings are initialized or changed
void settings_changed (settings_t *settings)
{
	hal.driver_cap.variable_spindle = spindle_precompute_pwm_values(&spindle_pwm, 12000000UL);

#if (STEP_OUTMODE == GPIO_MAP) || (DIRECTION_OUTMODE == GPIO_MAP)
    uint8_t i;
#endif

#if STEP_OUTMODE == GPIO_MAP
    for(i = 0; i < sizeof(step_outmap) / sizeof(uint32_t); i++)
        step_outmap[i] = c_step_outmap[i] ^ c_step_outmap[settings->steppers.step_invert.value];
#endif

#if DIRECTION_OUTMODE == GPIO_MAP
    for(i = 0; i < sizeof(dir_outmap) / sizeof(uint32_t); i++)
        dir_outmap[i] = c_dir_outmap[i] ^ c_dir_outmap[settings->steppers.dir_invert.value];
#endif

    if(IOInitDone) {

        stepperEnable(settings->steppers.deenergize);

        if(hal.driver_cap.variable_spindle) {
            pwm_init(&SPINDLE_PWM_CHANNEL, SPINDLE_PWM_USE_PRIMARY_PIN, SPINDLE_PWM_USE_SECONDARY_PIN, spindle_pwm.period, 0);
            hal.spindle_set_state = spindleSetStateVariable;
        } else
        	hal.spindle_set_state = spindleSetState;

        if(hal.driver_cap.step_pulse_delay && settings->steppers.pulse_delay_microseconds) {
            hal.stepper_pulse_start = &stepperPulseStartDelayed;
            PULSE_TIMER->MCR |= MR0I;                   // Enable CCR1 interrupt
        } else {
            hal.stepper_pulse_start = &stepperPulseStart;
            PULSE_TIMER->MCR &= ~MR0I;                  // Disable CCR1 interrupt
        }
        PULSE_TIMER->MCR |= (MR1I|MR1S);
        PULSE_TIMER->MR0 = settings->steppers.pulse_microseconds + settings->steppers.pulse_delay_microseconds;
        PULSE_TIMER->MR1 = settings->steppers.pulse_delay_microseconds;

        /*************************
         *  Control pins config  *
         *************************/

        control_signals_t control_ire;

        control_ire.mask = ~(settings->control_disable_pullup.mask ^ settings->control_invert.mask);

        BITBAND_PERI(CONTROL_INTENR, CYCLE_START_PIN) = 0;
        BITBAND_PERI(CONTROL_INTENR, FEED_HOLD_PIN) = 0;
        BITBAND_PERI(CONTROL_INTENR, SAFETY_DOOR_PIN) = 0;
        BITBAND_PERI(CONTROL_INTENR, RESET_PIN) = 0;
        BITBAND_PERI(CONTROL_INTENF, CYCLE_START_PIN) = 0;
        BITBAND_PERI(CONTROL_INTENF, FEED_HOLD_PIN) = 0;
        BITBAND_PERI(CONTROL_INTENF, SAFETY_DOOR_PIN) = 0;
        BITBAND_PERI(CONTROL_INTENF, RESET_PIN) = 0;

        gpio_pinmode(CONTROL_PORT, CYCLE_START_PIN, settings->control_disable_pullup.cycle_start ? PINMODE_PULLDOWN : PINMODE_PULLUP);
        gpio_pinmode(CONTROL_PORT, FEED_HOLD_PIN, settings->control_disable_pullup.feed_hold ? PINMODE_PULLDOWN : PINMODE_PULLUP);
        gpio_pinmode(CONTROL_PORT, SAFETY_DOOR_PIN, settings->control_disable_pullup.safety_door_ajar ? PINMODE_PULLDOWN : PINMODE_PULLUP);
        gpio_pinmode(CONTROL_PORT, RESET_PIN, settings->control_disable_pullup.reset ? PINMODE_PULLDOWN : PINMODE_PULLUP);

        CONTROL_INTCLR = CONTROL_MASK;

        if(control_ire.cycle_start)
        	BITBAND_PERI(CONTROL_INTENR, CYCLE_START_PIN) = control_ire.cycle_start;
        else
        	BITBAND_PERI(CONTROL_INTENF, CYCLE_START_PIN) = !control_ire.cycle_start;

        if(control_ire.feed_hold)
        	BITBAND_PERI(CONTROL_INTENR, FEED_HOLD_PIN) = control_ire.feed_hold;
        else
        	BITBAND_PERI(CONTROL_INTENF, FEED_HOLD_PIN) = !control_ire.feed_hold;

        if(control_ire.safety_door_ajar)
        	BITBAND_PERI(CONTROL_INTENR, SAFETY_DOOR_PIN) = control_ire.safety_door_ajar;
        else
        	BITBAND_PERI(CONTROL_INTENF, SAFETY_DOOR_PIN) = !control_ire.safety_door_ajar;

        if(control_ire.reset)
        	BITBAND_PERI(CONTROL_INTENR, RESET_PIN) = control_ire.reset;
        else
        	BITBAND_PERI(CONTROL_INTENF, RESET_PIN) = !control_ire.reset;

        /***********************
         *  Limit pins config  *
         ***********************/

