terjeio/grblHAL/drivers/LPC1769/src/driver.c
        axes_signals_t limit_ire;

        limit_ire.mask = ~(settings->limits.disable_pullup.mask ^ settings->limits.invert.mask);

        gpio_pinmode(LIMIT_PORT, X_LIMIT_PIN, settings->limits.disable_pullup.x ? PINMODE_PULLDOWN : PINMODE_PULLUP);
        gpio_pinmode(LIMIT_PORT, X_LIMIT_PIN, settings->limits.disable_pullup.x ? PINMODE_PULLDOWN : PINMODE_PULLUP);
        gpio_pinmode(LIMIT_PORT, X_LIMIT_PIN, settings->limits.disable_pullup.x ? PINMODE_PULLDOWN : PINMODE_PULLUP);

		/**********************
	 	 *  Probe pin config  *
		 **********************/

        gpio_pinmode(PROBE_PORT, PROBE_PIN, hal.driver_cap.probe_pull_up ? PINMODE_PULLUP : PINMODE_PULLDOWN);

    }
}

void NVIC_IRQEnable (uint32_t irqNum)
{
    if(irqNum < 32)
        NVIC->ISER[0] = 1 << irqNum; // Enable limit port Y,Z interrupt
    else
        NVIC->ISER[1] = 1 << (irqNum - 32); // Enable limit port Y,Z interrupt
}

void NVIC_IRQPriority(uint32_t irqNum, uint8_t priority)
{
    uint32_t temp;

    temp = NVIC->IP[irqNum >> 2];
    temp &= ~(0xFF << (8 * (irqNum & 3)));
    temp |= priority << (8 * (irqNum & 3));
    NVIC->IP[irqNum >> 2] = temp;
}

// Initializes MCU peripherals for Grbl use
static bool driver_setup (settings_t *settings)
{
  //    Interrupt_disableSleepOnIsrExit();

    SysTick->LOAD = 480000 - 1;
    SysTick->CTRL |= SysTick_CTRL_CLKSOURCE_Msk|SysTick_CTRL_TICKINT_Msk;

 // Stepper init

    STEP_PORT->FIODIR |= STEP_MASK;
    DIRECTION_PORT->FIODIR |= DIRECTION_MASK;
    STEPPERS_DISABLE_PORT->FIODIR |= STEPPERS_DISABLE_BIT;

    STEPPER_TIMER->TCR = 0;            // disable
    STEPPER_TIMER->CTCR = 0;           // timer mode
    STEPPER_TIMER->PR = 0;             // no prescale
    STEPPER_TIMER->MCR = MR0I|MR0R;    // MR0: !stop, reset, interrupt
    STEPPER_TIMER->CCR = 0;            // no capture
    STEPPER_TIMER->EMR = 0;            // no external match

    PULSE_TIMER->TCR = 2;
    PULSE_TIMER->CTCR = 0;
    PULSE_TIMER->PR = SystemCoreClock / 1000000; // to 1 us
    PULSE_TIMER->TCR = 0;

    NVIC_IRQEnable(STEPPER_TIMER_INT0);   // Enable stepper interrupt
    NVIC_IRQEnable(PULSE_TIMER_INT0);     // Enable step pulse interrupt

    NVIC_IRQPriority(PULSE_TIMER_INT0, 0x00);
    NVIC_IRQPriority(STEPPER_TIMER_INT0, 0x20);

 // Limit pins init

    NVIC_IRQEnable(EINT3_IRQn);  // Enable limit & control ports interrupt

 // Control pins init
 // NOTE: CS is shared with limit isr

//    NVIC_IRQEnable(CONTROL_INT);  // Enable limit port interrupt

    if(hal.driver_cap.software_debounce) {
        DEBOUNCE_TIMER->TCR = 2;
        DEBOUNCE_TIMER->CTCR = 0;
        DEBOUNCE_TIMER->PR = SystemCoreClock / 1000000; // 1 us
        DEBOUNCE_TIMER->MCR |= (MR0I|MR0S);
        DEBOUNCE_TIMER->MR0 = 4000; // 40 ms
        DEBOUNCE_TIMER->TCR = 0;
        NVIC_IRQEnable(DEBOUNCE_TIMER_INT0); // Enable debounce interrupt
    }

 // Spindle init

    SPINDLE_ENABLE_PORT->FIODIR |= SPINDLE_ENABLE_BIT;
    SPINDLE_DIRECTION_PORT->FIODIR |= SPINDLE_DIRECTION_BIT; // Configure as output pin.

 // Coolant init

    COOLANT_FLOOD_PORT->FIODIR |= COOLANT_FLOOD_BIT;
    COOLANT_MIST_PORT->FIODIR |= COOLANT_MIST_BIT;

#if SDCARD_ENABLE
    sdcard_init();
#endif

 // Set defaults

    IOInitDone = settings->version == 14;

    settings_changed(settings);

    hal.spindle_set_state((spindle_state_t){0}, 0.0f);
    hal.coolant_set_state((coolant_state_t){0});
    stepperSetDirOutputs((axes_signals_t){0});

    return IOInitDone;
}

// Initialize HAL pointers, setup serial comms and enable EEPROM
// NOTE: Grbl is not yet configured (from EEPROM data), driver_setup() will be called when done

bool driver_init (void) {

    // Enable EEPROM and serial port here for Grbl to be able to configure itself and report any errors

    SystemInit();

    serialInit();

    hal.info = "LCP1769";
    hal.driver_setup = driver_setup;
    hal.f_step_timer = SystemCoreClock;
    hal.rx_buffer_size = RX_BUFFER_SIZE;
    hal.delay_ms = &driver_delay;
    hal.settings_changed = settings_changed;

#if SDCARD_ENABLE
    hal.driver_reset = sdcard_reset;
#endif

    hal.stepper_wake_up = stepperWakeUp;
    hal.stepper_go_idle = stepperGoIdle;
    hal.stepper_enable = stepperEnable;
    hal.stepper_cycles_per_tick = stepperCyclesPerTick;
    hal.stepper_pulse_start = stepperPulseStart;

    hal.limits_enable = limitsEnable;
    hal.limits_get_state = limitsGetState;

    hal.coolant_set_state = coolantSetState;
    hal.coolant_get_state = coolantGetState;

    hal.probe_get_state = probeGetState;
    hal.probe_configure_invert_mask = probeConfigureInvertMask;

    hal.spindle_set_state = spindleSetState;
    hal.spindle_get_state = spindleGetState;
    hal.spindle_update_rpm = spindleUpdateRPM;

    hal.system_control_get_state = systemGetState;

    hal.stream.read = serialGetC;
    hal.stream.write = serialWriteS;
    hal.stream.write_all = serialWriteS;
    hal.stream.get_rx_buffer_available = serialRxFree;
    hal.stream.reset_read_buffer = serialRxFlush;
    hal.stream.cancel_read_buffer = serialRxCancel;

    hal.eeprom.type = EEPROM_None;
//    hal.eeprom.get_byte = eepromGetByte;
//    hal.eeprom.put_byte = eepromPutByte;
//    hal.eeprom.memcpy_to_with_checksum = eepromWriteBlockWithChecksum;
//    hal.eeprom.memcpy_from_with_checksum = eepromReadBlockWithChecksum;

#ifdef _flash_h_
    hal.eeprom.memcpy_from_flash = memcpy_from_flash;
    hal.eeprom.memcpy_to_flash = memcpy_to_flash;
#endif

    hal.set_bits_atomic = bitsSetAtomic;
    hal.clear_bits_atomic = bitsClearAtomic;
    hal.set_value_atomic = valueSetAtomic;
/*
    hal.userdefined_mcode_check = userMCodeCheck;
    hal.userdefined_mcode_validate = userMCodeValidate;
    hal.userdefined_mcode_execute = userMCodeExecute;
*/
#ifdef HAS_KEYPAD
    hal.execute_realtime = process_keypress;
#endif

  // driver capabilities, used for announcing and negotiating (with Grbl) driver functionality

    hal.driver_cap.spindle_dir = On;
    hal.driver_cap.variable_spindle = On;
    hal.driver_cap.mist_control = On;
    hal.driver_cap.software_debounce = On;
    hal.driver_cap.step_pulse_delay = On;
    hal.driver_cap.amass_level = 3;
    hal.driver_cap.control_pull_up = On;
    hal.driver_cap.limits_pull_up = On;
    hal.driver_cap.probe_pull_up = On;
#if SDCARD_ENABLE
    hal.driver_cap.sd_card = On;
#endif
    // no need to move version check before init - compiler will fail any mismatch for existing entries
    return hal.version == 4;
}

/* interrupt handlers */

// Main stepper driver
void STEPPER_IRQHandler (void)
{
    STEPPER_TIMER->IR = STEPPER_TIMER->IR;
    hal.stepper_interrupt_callback();
}

