terjeio/grblHAL/drivers/LPC1769/src/driver.c
/* The Stepper Port Reset Interrupt: This interrupt handles the falling edge of the step
   pulse. This should always trigger before the next general stepper driver interrupt and independently
   finish, if stepper driver interrupts is disabled after completing a move.
   NOTE: Interrupt collisions between the serial and stepper interrupts can cause delays by
   a few microseconds, if they execute right before one another. Not a big deal, but can
   cause issues at high step rates if another high frequency asynchronous interrupt is
   added to Grbl.
*/

// This interrupt is used only when STEP_PULSE_DELAY is enabled. Here, the step pulse is
// initiated after the STEP_PULSE_DELAY time period has elapsed. The ISR TIMER2_OVF interrupt
// will then trigger after the appropriate settings.pulse_microseconds, as in normal operation.
// The new timing between direction, step pulse, and step complete events are setup in the
// st_wake_up() routine.

// This interrupt is enabled when Grbl sets the motor port bits to execute
// a step. This ISR resets the motor port after a short period (settings.pulse_microseconds)
// completing one step cycle.
void STEPPULSE_IRQHandler (void)
{
	uint32_t ifg = PULSE_TIMER->IR;
    if(ifg & MR0IFG)
        stepperSetStepOutputs(next_step_outbits); // Begin step pulse.
    if(ifg & MR1IFG)
        stepperSetStepOutputs((axes_signals_t){0});
    PULSE_TIMER->IR = ifg;
}

void DEBOUNCE_IRQHandler (void)
{
	PULSE_TIMER->IR = MR0IFG;

    axes_signals_t state = (axes_signals_t)limitsGetState();

    if(state.value) //TODO: add check for limit swicthes having same state as when limit_isr were invoked?
        hal.limit_interrupt_callback(state);
}


void GPIO_IRQHandler (void)
{
    uint32_t istat = LPC_GPIOINT->IntStatus, iflags;

    if(istat & P0Int) {
    	iflags = LIMIT_INTSTR | LIMIT_INTSTF;
    	if(iflags & LIMIT_MASK) {
    		LIMIT_INTCLR = iflags;
			if(hal.driver_cap.software_debounce)
				DEBOUNCE_TIMER->TCR = 1;
			else
				hal.limit_interrupt_callback(limitsGetState());
    	}
    }

    if(istat & P2Int) {
    	iflags = CONTROL_INTSTR | CONTROL_INTSTF;
    	if(iflags & CONTROL_MASK) {
    		CONTROL_INTCLR = iflags;
			if(hal.driver_cap.software_debounce)
				DEBOUNCE_TIMER->TCR = 1;
			else
				hal.control_interrupt_callback(systemGetState());
    	}
    }

}

// Interrupt handler for 1 ms interval timer
void SYSTICK_IRQHandler (void)
{
    if(!(--delay.ms)) {
        SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;
        if(delay.callback) {
            delay.callback();
            delay.callback = NULL;
        }
    }
}
